data.stock=[//"'"必須用&#39取代, 增加新年度需改成stockold.sYYYY and tempy
[0,"6911","群運","","",-1,"",3,0,1,"","",0,1,"01/08","01/29"],
[0,"5483","中美晶","","",-1,"",7,0,1,"","",0,1,"01/08","02/06"],
[0,"4946","辣椒","香氛片","115/01/09",1,"12/10",3,0,0,"","12/25~115/01/06",0,0,"",""],
[0,"2454","聯發科","","",-1,"",1,0,1,"","",0,29,"01/06","01/30"],
[0,"2247","汎德永業","","",-1,"",8,0,1,"","",0,6.5,"01/08","02/06"],
[0,"6613","朋億","","",-1,"",5,0,1,"","",0,3,"01/12","01/30"],
[0,"6629","泰金-KY","","",-1,"",1,0,1,"","",0,2,"01/08","02/11"],
[0,"6737","秀育","","",-1,"",9,0,1,"","",0,0.8,"01/05","01/30"],
[0,"2758","路易莎咖啡","","",-1,"",2,0,1,"","",0,1,"01/15","02/12"],
[0,"6763","綠界科技*","","",-1,"",1,0,1,"","",0,0.95,"01/12","02/06"],
[0,"5536","聖暉*","","",-1,"",5,0,1,"","",0,5.5,"01/15","02/04"],
[0,"8489","三貝德","智能學習體驗劵","01/22",2,"12/23",10,0,0,"","01/07~01/19",0,0,"",""],
];
//基隆0,北市1,新北2,桃園3,竹市4,竹縣5,苗栗6,中市7,彰化8,雲林9,南投10,嘉市11,嘉縣12,臺南13,高雄14,屏東15,宜蘭16,花蓮17,臺東18,澎湖19,連江20,金門21
data.ag=[
"永豐,永豐金證券（股）公司股務代理部,台北市中正區博愛路17號3樓,02-23816288,25.04573052780303,121.51153588119271",
"中信,中國信託商業銀行代理部,臺北市中正區重慶南路一段83號5樓,02-66365566,25.043790709650796,121.51358839569366",
"台新,台新證券股務代理部,台北市建國北路一段96號地下一樓,02-25048125,25.050364713764516,121.53627755455398",
"統一,統一綜合證券股份有限公司股務代理部,台北市東興路8號地下一樓,02-27463797,25.050243111666386,121.56485314196924",
"華上,華上光電股份有限公司股務室,台北市內湖區瑞湖街58號12樓,02-26587718,25.074201702947153,121.5755949005832",
"凱基,凱基證券股份有限公司股務代理部,台北市重慶南路一段二號5樓,02-23892999,25.046898100902197,121.5131394296064",
"元富,元富證券股份有限公司股務代理部,台北市松山區光復北路11巷35號地下一樓,02-27686668,25.050269195762823,121.55986668915911",
"元大,元大證券股份有限公司股務代理部,台北市承德路3段210號地下一樓,02-25865859,25.070664266738234,121.5179945218368",
"群益,群益金鼎證券股務代理部,台北市大安區敦化南路二段97號B2,02-27023999,25.028896035069994,121.54945800542166",
"富邦,富邦綜合證券股份有限公司股務代理部,台北市中正區許昌街17號2樓,02-23611300,25.045856554053763,121.51683600832695",
"福邦,福邦證券股份有限公司股務代理部,台北市中正區忠孝西路一段6號6樓,02-23711658,25.045825156288487,121.51796302695689",//10
"宏遠,宏遠證券股份有限公司股務代理部,台北市信義路四段236號3樓,02-23268818,25.032990402426336,121.55317933661007",
"康和,康和綜合證券股份有限公司股務代理部,台北市信義區基隆路一段176號B1,02-87871888,25.042869471485343,121.56513500827982",
"兆豐,兆豐證券股份有限公司股務代理部,台北市忠孝東路二段95號1樓,02-33930898,25.04304806238611,121.53101017251889",
"亞東,亞東證券股份有限公司股務代理部,新北市板橋區新站路16號13樓,02-77531699,25.013110438181357,121.46692454588735",
"大同,大同股份有限公司股務課,臺北市中山區中山北路3段22號,02-25925252#3258,25.06451185259711,121.52165935392978",
"新光,新光證券股份有限公司股務代理部,台北市中正區重慶南路1段66之1號11樓,02-23118787,25.046906034577006,121.51341906099759",
"士林,士林電機廠股份有限公司股務組,台北市中山北路六段88號8樓,02-28342662轉366,25.104997769468824,121.52500714037498",
"台中銀行,台中銀行股務科,台北市中正區新生南路一段50號11樓,02-23957388,25.04191457389476,121.53254801243727",
"日盛,日盛證券股份有限公司股務代理部,台北市中山區南京東路二段85號7樓,02-25419977,25.052356339835598,121.53188599237181",
"中石化,中石化股務室,台北市松山區東興路12號3樓,02-89782589,25.050154266131834,121.5651054277546",//20
"中纖,中纖公司股務課,台北市中正區新生南路一段50號11樓,02-23937111,25.04199128018715,121.53255570941856",
"第一金,第一金證券股份有限公司股務代理部,台北市大安區安和路一段27號6樓,02-25635711,25.03930926547928,121.55044028770797",
"正隆,正隆股份有限公司股務課,新北市板橋區民生路一段三號三樓,02-22225131,25.01187877500303,121.47598462048225",
"華映,中華映管股份有限公司股務辦事處,台北市中山區中山北路3段22號,02-25925252,25.06455303610579,121.52166799728897",
"華邦,華邦電子股份有限公司股務辦事處,台北市內湖區行善路398號8樓,02-27905885,25.06312996644439,121.58456968136132",
"燁輝,燁輝企業股份有限公司台北股務課,台北巿北平東路30號15樓,02-23956780,25.045555438947055,121.52679313078579",
"國票,國票綜合證券股份有限公司股務代理部,台北市南京東路五段188號15樓,02-25288988,25.05124945768301,121.56359194926725",
"華南永昌,華南永昌綜合證券（股）公司股務代理部,台北市民生東路四段54號4樓,02-27186425,25.057568203746253,121.55108112123716",
"台肥,台灣肥料股份有限公司（股務組）,台北市南港區經貿一路170號16樓,02-25422231,25.057701993044805,121.61811086824675",
"愛地雅,愛地雅工業股份有限公司股務室,台北市敦化南路二段98號12樓,02-27051333,25.028038280175696,121.54837840525617",//30
"山隆,山隆通運股份有限公司股務課,新北市板橋區民生路一段三號三樓,02-22225131,25.01184866862768,121.47600235191882",
"華新,華新公司股務室,臺北市內湖區行善路398號8樓,02-27905885,25.063114938208763,121.58457912101525",
"和桐,和桐公司股務室,新北市五股區中興路1段6號1樓,02-89769289,25.07258537238879,121.46973708749108",
"旺宏,旺宏電子股份有限公司股務室,台北市中山區松江路162之1號2樓,02-25638128,25.05550372249355,121.53287173460566",
"富喬,富喬工業股份有限公司股務室,台北市敦化南路二段98號12樓,02-27051333,25.028055569438433,121.54837193965142",
"和鑫,和鑫光電股份有限公司股務辦事處,台北市內湖區行善路398號8樓,02-27905885,25.063102558734727,121.58457631680766",
"自辦,公司股務部,台北市敦化南路1段3號十樓,02-26503773,25.04772059728767,121.54936404780456",
"自辦,公司股務室,臺北市內湖區行善路158號,02-66007998,25.05821181021307,121.57809938059516",
"瀚宇博,瀚宇博德股份有限公司股務辦事處,臺北市內湖區行善路398號8樓,02-27905885,25.06314099299672,121.58459601804114",
"朋程,朋程公司股務室,台北市內湖區瑞光路392號1樓,02-87982301,25.077886942552194,121.57110065743746",//40
"閎暉,閎暉公司股務室,台北市內湖區瑞光路392號1樓,02-87982301,25.077886942552194,121.57110065743746",
"台達化工,台達化工公司股務部,台北市內湖區內湖路一段120巷17號6樓,02-26503773,25.082116161697936,121.56245213940379",
"自辦,公司股務,台北市南京東路二段150號7樓,02-25156421,25.05186451419759,121.53417928657376",
"台灣精星,台灣精星科技股份有限公司股務辦事處,臺北市內湖區行善路398號8樓,02-27905885,25.063118607355754,121.58457461352283",
"永大機電,永大機電工業股份有限公司,台北市復興北路99號11樓,02-27172217#242,25.05285467633542,121.54439669512796",
"自辦,公司股務室,105台北市松山區復興北路369號7樓之5,02-27195000,25.06261305977356,121.54472554606642",
"燿華,燿華電子股務室,台北市大安區敦化南路二段98號12樓,02-27051333,25.0280389416856,121.54837630264771",
"精成,精成科技股份有限公司股務辦事處,臺北市內湖區行善路398號8樓,02-27905885,25.063099788710165,121.58458355641298",
"自辦,公司股務室,台北市內湖區瑞光路392號1樓,02-87982301,25.07786051970544,121.57104776544278",
"自辦,公司自辦,,地址與電話請洽公司股務室",//50
"自辦,公司股務部,台北市內湖區內湖路一段120巷17號6樓,02-2650-3773,25.082121723142677,121.56245418505947",
"自辦,公司股務組,台北市中山北路二段65巷9號4樓,02-210002100#6,25.057246689002614,121.52382761784804",
"自辦,太平洋建設股份有限公司股務部,台北市信義區光復南路495號6樓之6,02-27227686,25.032481600804296,121.55770804566741",
"自辦,公司股務,臺北市內湖區行善路398號8樓,02-27905885,25.063099788710165,121.58458355641298",
"自辦,公司股務部,台北市民生東路2段166號2樓,02-2500-1668,25.05765779932913,121.53418634507953",
"春源,春源鋼鐵工業股份有限公司財務部,台北市中山區復興北路502號4樓股務辦公室,02-25018111,25.06561720883493,121.54409230514533",
"自辦,公司股務部,台北市松山區敦化北路201號台塑大樓後棟1樓,02-27189898,25.0570190924794,121.55069150498166",
"台玻,台灣玻璃工業股份有限公司股務部,台北市松山區南京東路三段261號8樓,2713-0333#1326,25.05209155938221,121.545170279249",
"國泰金,國泰金控行政管理部股務科,台北市仁愛路四段296號地下一樓,02-27087698#9,25.037408378531275,121.55363724162335",
"自辦,公司股務部,台北市中山區南京東路三段210號11樓,02-27717611,25.051619846191162,121.54319189126016",//60
"自辦,國泰建設營運管理部財務組（股務）,台北市敦化南路二段218號2樓,(02)23779968,25.021816141892334,121.54829515333103",
"自辦,公司股務室,台北市中山區八德路二段308號12樓,02-81619999#2261,25.047062488489516,121.5425879265054",
"自辦,公司股務,台北市中山北路六段90號2樓,02-28342662轉366,25.105056524164834,121.52500730300146",
"自辦,公司股務,台北市民生東路三段115號1樓,(02)2719-1313轉1,25.058160861812073,121.5464267094081",
"自辦,公司股務,台北市中山區南京東路2段206號13樓之5,(02)25071234,25.051740004791853,121.53562813110561",
"第一銀,第一銀行信託處股務代理部,台北市延平南路42號,2348-11371140,25.045883329654824,121.51051070185902",
"自辦,公司股務室,台北市中山區八德路二段308號12樓,02-81617958,25.047085695886427,121.54266817274649",
"自辦,公司股務課,臺北市中華路一段41號11樓,02-2375-3211,25.04499113447745,121.50950550635304",
"自辦,公司股務單位,台北市中正區新生南路一段50號11樓,2395-3881,25.04194084988226,121.53253276225136",
"自辦,公司股務單位,台北市大同區涼州街62號,02-25536052,25.06054865654964,121.51105766982376",//70
"自辦,公司股務單位,新北市新店區中興路三段三號1樓,02-25156421,24.977670275708462,121.54552928043796",
"自辦,公司股務單位,台北市內湖區南京東路六段380號10樓,02-27189898,25.059525618462573,121.58705437383146",
"公司股務課,公司股務單位,新北市三重區重陽路3段99號10樓,(02)29820061,25.068130951481333,121.49045817333337",
"國泰,股務代理部,台北市大安區敦化南路二段39號2樓,(02)7757-1288,25.03169266742629,121.54916558307399",
];//ag,零股寄單,type
var tempy=[2024,2023,2022,2021,2020,2019,2018,2017,2016];
if(data.stocky.toString()!=tempy.toString()){ data.stocky=tempy;savedata(); }
var storeurl="";
window.pic=["NDZDX7P"//統一50卡 https://i.imgur.com/"+pic[0]+".jpg
 ,"FsmLHZL"//全家50卡
 ,"J9o45n0"//全家50券
 ,"IYYuXLP"//全家88卡
 ,"Gpr05gS"//統一100卡
 ,""//統一88卡 5
 ,"jXAC781"//統一35卡
 ,"iba6VJ7"//全家35卡
 ,"5R4amgg"//全家100卡
 ,"3XtQw96"//統一200卡
 ,"ObRve40"//全家200卡 10
 ,"3l1HdmF"//全家中美
 ,"MS5pT4K"//全家300
 ,"FVrQl7q"//統一中美
 ];
 var needupdate=0;
 init.tempf=function(){//text中的onclick無法用local var tempf的方式
  if(needupdate==1) stocksw(ydate);
  var tempt="資料數 : "+data.stock.length+" 筆。<br>最　新 : "+data.stock[data.stock.length-1][2]+"("+data.stock[data.stock.length-1][1]+")";
  //var tempt="資料數 : "+data.stock.length+" 筆。<div style='margin:0.5em auto 0.1em'>新增照片 : 2002 (中鋼)</div>";
  setTimeout(function(){ msgoff(function(){ msg("confirm","<span style='font-size:0.9em'>"+tempt+"</span>",0,{sty:"height:6em"}); }); },2500);
 };
function nextyear(){ var o0=document.getElementById("years"),o=document.createElement("div");//搶先看
 stockold["s"+(ydate+1)]=[
 ];
 if(!stockold["s"+(ydate+1)].length) return;
 o.setAttribute("style", "background-color:#a00");o.className="yearsex thisyear";o.innerHTML="<b style='font-size:1.5em;line-height:1.4em'>"+(ydate+1)+"</b>";
 o.onclick=function(){ stocksw(ydate+1);
  setTimeout(function(){ var tempo=document.getElementById("old");tempo.innerHTML=(ydate+1)+" 搶先報";ani(tempo,["bottom","opacity"],[1,0],[3,1],["em",""],500,"popout1.5"); },3000);
 };
 o0.insertBefore(o,o0.childNodes[0]);o0.childNodes[1].style.borderTop="none";
}
(function(){
 var mlans=[
  {zh:"更新",en:"Update",ja:"更新"},
  {zh:"有新版本，是否前往更新？",en:"There is a new version, do you want to update?",ja:"新しいバージョンがありますが、更新しますか？"},
  {zh:"重大更新，請前往更新後繼續。",en:"Major update, please continue after update.",ja:"メジャーアップデート、アップデート後も続行してください。"},
 ];
/*
 if(createAd.test){
  if(vartxt!=appname+"220129"){ needupdate=1;
   var updateurl=typeof Android!=="undefined"?"https://play.google.com/store/apps/details?id=com.maxdev."+appname:(chkdevice=="ios"?"https://apps.apple.com/tw/app/id1115337333":(winotify?"https://www.youtube.com/channel/UCKeYMwzRh8BXSZ-Dgvm0fUg/featured":""));
   var tempt="<div style='box-shadow:0 1px 0 0 #aaa inset;width:50%;height:3em;line-height:3em;float:left' onclick='msgoff(init.tempf)'>"+mlan0[14]+"</div>";
   if(parseInt(vartxt.replace(appname,""))<220129){ needupdate=2;tempt=""; }//重大更新時執行
   setTimeout(function(){ msg("pop2","<div style='position:relative;width:100%;height:1.5em;background:#000 url(maxdev.png) center center no-repeat;background-size:auto 70%;opacity:0.8' class='tb'></div><div style='position:relative;width:100%;height:5em' class='tb'><div><div style='width:80%;line-height:1.5em;text-align:justify'>★ "+mlans[tempt?1:2][lanset.now]+"</div></div></div>"+tempt+"<div style='background:rgba(0,0,0,0.2);width:"+(tempt?50:100)+"%;height:3em;line-height:3em;float:left' onclick='openurl(\""+updateurl+"\")'><span style='background:#eee;width:4em;height:1.2em;padding:0.2em 0.5em;border:1px solid #888;border-radius:0.3em;box-shadow:-2px -2px 0.2em #ccc inset;font-size:1.2em'> "+(tempt?mlan0[13]:mlans[0][lanset.now])+" </span></div>",null,{sty:"color:#000;height:9.5em;margin-top:-4em",cover:1});
   },2500);
  }
 }
*/
})();
if(new Date(new Date().getTime()+60000*new Date().getTimezoneOffset()+28800000).getMonth()==11) nextyear();
if(!needupdate) init.tempf();